---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.HasCurrent
source: html/dd280dc2-1f7c-9e7c-4a46-246fd4b6556b.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.HasCurrent Method

Identifies whether the iterator has a current item.
 There is no current item if the iterator has not started yet or has been done.

## Syntax (C#)
```csharp
public bool HasCurrent()
```

## Returns
True if there is a current item.